acmeat-backend/src/api/util/testWsdl.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="acme.bank.com.wsdl" xmlns:xsd1="acme.bank.com.xsd" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="acme.bank.com.wsdl" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
    <xs:schema targetNamespace="acme.bank.com.xsd" xmlns:sch="acme.bank.com.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:element name="refundTransaction"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="sid" type="xs:string"/><xs:element maxOccurs="1" minOccurs="0" name="token" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="refundTransactionResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="0" name="token" type="xs:string"/><xs:element maxOccurs="1" minOccurs="0" name="status" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:element name="newTransaction"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="to_user" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="amount" type="xs:double"/><xs:element maxOccurs="1" minOccurs="1" name="sid" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="newTransactionResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="0" name="token" type="xs:string"/><xs:element maxOccurs="1" minOccurs="0" name="status" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:element name="logout"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="0" name="message" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="sid" type="xs:string"/><xs:element maxOccurs="1" minOccurs="0" name="username" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="verifyTransaction"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="to_user" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="amount" type="xs:double"/><xs:element maxOccurs="1" minOccurs="1" name="sid" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="token" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="verifyTransactionResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="0" name="token" type="xs:string"/><xs:element maxOccurs="1" minOccurs="0" name="status" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:element name="login"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="password" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="username" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="loginResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="0" name="message" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="sid" type="xs:string"/><xs:element maxOccurs="1" minOccurs="0" name="username" type="xs:string"/></xs:sequence></xs:complexType></xs:element></xs:schema>
  </wsdl:types>
  <wsdl:message name="LoginRequest">
    <wsdl:part name="body" element="xsd1:login">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="VerifyTransactionRequest">
    <wsdl:part name="body" element="xsd1:verifyTransaction">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="NewTransactionRequest">
    <wsdl:part name="body" element="xsd1:newTransaction">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="Message">
    <wsdl:part name="body" element="xsd1:loginResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="TransactionResponse">
    <wsdl:part name="body" element="xsd1:verifyTransactionResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="RefundTransactionRequest">
    <wsdl:part name="body" element="xsd1:refundTransaction">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="BankService">
    <wsdl:operation name="refundTransaction">
      <wsdl:input message="tns:RefundTransactionRequest">
    </wsdl:input>
      <wsdl:output message="tns:TransactionResponse">
    </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="newTransaction">
      <wsdl:input message="tns:NewTransactionRequest">
    </wsdl:input>
      <wsdl:output message="tns:TransactionResponse">
    </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="logout">
      <wsdl:input message="tns:Message">
    </wsdl:input>
    </wsdl:operation>
    <wsdl:operation name="verifyTransaction">
      <wsdl:input message="tns:VerifyTransactionRequest">
    </wsdl:input>
      <wsdl:output message="tns:TransactionResponse">
    </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="login">
      <wsdl:input message="tns:LoginRequest">
    </wsdl:input>
      <wsdl:output message="tns:Message">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BankServiceSOAPBinding" type="tns:BankService">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="refundTransaction">
      <soap:operation soapAction="refundTransaction" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="newTransaction">
      <soap:operation soapAction="newTransaction" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="logout">
      <soap:operation soapAction="logout" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="verifyTransaction">
      <soap:operation soapAction="verifyTransaction" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="login">
      <soap:operation soapAction="login" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="BankServiceService">
    <wsdl:port name="BankServiceServicePort" binding="tns:BankServiceSOAPBinding">
      <soap:address location="http://bank:8765"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
